solvers/driftFluxFoam/testcases/terminalVelocity/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  LES;//RAS;

RAS
{
    model    buoyantKEpsilon;

    turbulence      on;
    printCoeffs     on;

    buoyantKEpsilonCoeffs
    {
        Cg      0.85;
    }
}

LES
{
    model    Smagorinsky;

    turbulence      on;
    printCoeffs     on;
    
    SmagorinskyCoeffs
    {
            Ck                  0.094;
            Ce                  1.048;
    }
    
    delta           cubeRootVol;
 
    cubeRootvolCoeffs
    {
    deltaCoeff 1;
    }

}

// ************************************************************************* //
