solvers/driftFluxFoam/testcases/terminalVelocity/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 1.25 0);

boundaryField
{

    inlet
    {
        type            cyclic;
    }

    outlet
    {
        type            cyclic;
    }

    walls
    {
        type            noSlip;
    }

}

// ************************************************************************* //
