solvers/driftFluxFoam/testcases/terminalVelocity/system/fvConstraints
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvConstraints;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

momentumForce
{
    type            meanVelocityForce;

    selectionMode   all;

    U               U;
    Ubar            (0 1.25 0);
    relaxation       0.2;
}


// ************************************************************************* //
